w7d5/reddit/Reddit_Clone/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Wendy"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
         # debugger
        user = User.find_by(username: username)