w7d3/Mwapp/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 20]]
---
    def destroy
        @user = User.find(params[:id])
        @user.destroy