w6d5/cats/ninety-nine_cats/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]