w6d4/my_first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # render plain: "I'm in the index action!"
        # render json: params
        users = User.all

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "'wendy'"], ["email", "'wendy@gmailcom'"]]
---
    def create
        # render json: params #query string
        #  user = User.new(params.require(:user).permit(:name, :email))
         user = User.new(user_params)
         #user: new instance of user
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "joe"], ["email", "joe@gmail.com"], ["id", 3]]
---
    def update
         user = User.find(params[:id])

        #  if user.update(params.require(:user).permit(:name, :email))
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
        user = User.find(params[:id])
        user.destroy