w6d3/my_first_routes/app/controllers/users_controller.rb

    def index
        # render plain: "I'm in the index action!"
        # render json: params
        users = User.all
---
SELECT "users".* FROM "users"

    def create
        # render json: params #query string
         user = User.new(params.require(:user).permit(:name, :email))
        if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "'wendy'"], ["email", "'wendy@gmailcom'"]]

    def show
        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
         user = User.find(params[:id])

         if user.update(params.require(:user).permit(:name, :email))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "joe"], ["email", "joe@gmail.com"], ["id", 3]]